irvynX/ESP32/controladorCuarto/src/main.cpp
#if defined(ESP32)
// Librerias para ESP32
#include <WiFi.h>
#include <WiFiMulti.h>
#include <ESPmDNS.h>
#include <HTTPClient.h>
WiFiMulti wifiMulti;

#elif defined(ESP8266)
// Librerias para ESP8266
#include <ESP8266WiFi.h>
#include <ESP8266WiFiMulti.h>
#include <ESP8266mDNS.h>
ESP8266WiFiMulti wifiMulti;

#endif

#include <HTTPClient.h>
#include <ArduinoJson.h>

const String pagina1 = R"====(
<html>
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.0-alpha3/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-KK94CHFLLe+nY2dmCWGMq91rCGa5gtU4mk92HdvYe+M/SXH301p5ILy+dN9+nJOZ" crossorigin="anonymous">
    <title>APP-CUARTO</title>
</head>
<body class="bg-dark text-bg-dark">
    <div class="row">
        <div class="col-12">
            <div class="p-3">
                <form action="" method="get" class="text-center">
                    <div>
                        <h1> FOCO </h1>
                        <div class="btn-group" role="group" aria-label="Basic radio toggle button group">
                            <input type="radio" class="btn-check" name="foco" value="1" id="btnradio1" autocomplete="off" )====";
// ------------------------------- si el foco esta encendido agregamos un checked 
const String pagina2 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio1">ON</label>
                          
                            <input type="radio" class="btn-check" name="foco" value="0" id="btnradio2" autocomplete="off" )====";
// -------------------------------- si el foco esta apagado agregamos un checked
const String pagina3 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio2">OFF</label>
                        </div>
                        <br>
                        <br>
                        <br>
                        <input type="submit" value="enviar" class="btn btn-outline-info">
                    </div>
                </form>
                <br>
                <HR>
                <form action="" method="get" class="text-center">
                    <div>
                        <h1> TIRA LED ESCRITORIO </h1>
                        <div class="btn-group" role="group" aria-label="Basic radio toggle button group">
                            <input type="radio" class="btn-check" name="tiraE" value="1" id="btnradi" autocomplete="off" )====";
// ------------------------------- si la tira led escritorio esta encendida agregamos un checked
const String pagina4 = R"====(>
                            <label class="btn btn-outline-light" for="btnradi">ON</label>
                          
                            <input type="radio" class="btn-check" name="tiraE" value="0" id="btnrad" autocomplete="off" )====";
// ------------------------------ si la tira led escritorio esta apagada agregamos un checked
const String pagina5 = R"====(>
                            <label class="btn btn-outline-light" for="btnrad">OFF</label>
                        </div>
                        <br>
                        <br>
                        <br>
                        <h3> EFECTO </h3>
                        <div class="btn-group-vertical mb-4" role="group" aria-label="Basic radio toggle button group">
                            <input type="radio" class="btn-check" name="efecto" value="0" id="btnradio3" autocomplete="off" )====";
// ------------------------------ si el efecto es el o agregamos un checked
const String pagina6 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio3">ENCENDIDAS</label>
                          
                            <input type="radio" class="btn-check" name="efecto" value="1" id="btnradio4" autocomplete="off" )====";
// ------------------------------ si el efecto es el 1 agregamos un checked
const String pagina7 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio4">MUSICA 1</label>

                            <input type="radio" class="btn-check" name="efecto" value="2" id="btnradio5" autocomplete="off" )====";
// ------------------------------ si el efecto es el 2 agregamos un checked
const String pagina8 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio5">MUSICA 2</label>

                            <input type="radio" class="btn-check" name="efecto" value="3" id="btnradio6" autocomplete="off" )====";
// ------------------------------ si el efecto es el 3 agregamos un checked
const String pagina9 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio6">RECORRER TIRA</label>

                            <input type="radio" class="btn-check" name="efecto" value="4" id="btnradio7" autocomplete="off" )====";
// ------------------------------ si el efecto es el 4 agregamos un checked
const String pagina10 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio7">RESPIRAR</label>
                        </div>
                        <br>
                        <br>
                        <h3>BRILLO</h3>
                        <div class="mb-4">
                            <input type="range" class="form-range w-50 p-3" min="0" max="255" step="5" id="customRange3" name="brillo" value=")====";
// ------------------------------- ingresamos el valor en hexadecimal de la tira led
const String pagina11 = R"====(">
                        </div>
                        <br>
                        
                        <div class="mb-4 align-content-center">
                            <h3>COLOR</h3>
                            <input type="color" class="form-control form-control-color m-auto" value=")====";
// ------------------------------ ingresamos el brillo de nuestra tira led en un rango de 0 a 255
const String pagina12 = R"====(" title="Choose your color" name="color">
                        </div>
                        <input type="submit" value="enviar" class="btn btn-outline-info">
                    </div>
                </form>
                <br>
                <HR>
                <form action="" method="get" class="text-center">
                    <div>
                        <h1> TIRA LED GABINETE </h1>
                        <div class="btn-group" role="group" aria-label="Basic radio toggle button group">
                            <input type="radio" class="btn-check" name="tiraG" value="1" id="G" autocomplete="off" )====";
// ---------------------------- si la tira gabinete esta encendida agregamos checked
const String pagina13 = R"====(>
                            <label class="btn btn-outline-light" for="G">ON</label>
                          
                            <input type="radio" class="btn-check" name="tiraG" value="0" id="G1" autocomplete="off" )====";
// --------------------------- si la tira gabinete esta apagada agregamos checked
const String pagina14 = R"====(>
                            <label class="btn btn-outline-light" for="G1">OFF</label>
                        </div>
                        <br>
                        <br>
                        <br>
                        <h3> EFECTO </h3>
                        <div class="btn-group-vertical mb-4" role="group" aria-label="Basic radio toggle button group">
                            <input type="radio" class="btn-check" name="efecto" value="0" id="btnradio8" autocomplete="off" )====";
// -------------------------- si el efecto es 0 agregamos checked
const String pagina15 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio8">ENCENDIDAS</label>
                          
