irvynX/ESP32/controladorCuarto/src/main.cpp
                            <input type="radio" class="btn-check" name="efecto" value="1" id="btnradio9" autocomplete="off" )====";
// ------------------------- si el efecto es 1 agregamos checked
const String pagina16 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio9">MUSICA 1</label>

                            <input type="radio" class="btn-check" name="efecto" value="2" id="btnradio10" autocomplete="off" )====";
// -------------------------- si el efecto es 2 agregamos checked
const String pagina17 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio10">MUSICA 2</label>

                            <input type="radio" class="btn-check" name="efecto" value="3" id="btnradio11" autocomplete="off" )====";
// -------------------------- si el efcto es 3 agregamos checked
const String pagina18 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio11">RECORRER TIRA</label>

                            <input type="radio" class="btn-check" name="efecto" value="4" id="btnradio12" autocomplete="off" )====";
// -------------------------- si el efcto es 4 agregamos checked
const String pagina19 = R"====(>
                            <label class="btn btn-outline-light" for="btnradio12">RESPIRAR</label>
                        </div>
                        <br>
                        <br>
                        <h3>BRILLO</h3>
                        <div class="mb-4">
                            <input type="range" class="form-range w-50 p-3" min="0" max="255" step="5" id="customRange3" name="brillo" value=")====";
                        
// -------------------------- valor en hexadecimal del color
const String pagina20 = R"====(">
                        </div>
                        <div class="mb-4">
                            <h3>COLOR</h3>
                            <input type="color" class="form-control form-control-color m-auto" value=")====";
                        
// -------------------------- brillo de la tira led
const String pagina21 = R"====(" title="Choose your color" name="color">
                        </div>
                        <br>
                        <input type="submit" value="enviar" class="btn btn-outline-info">
                    </div>
                </form>
                <br>
                <HR>
                <form action="" method="get" class="text-center">
                    <h1> MICROFONO Y HORA </h1>
                    <div class="mb-4">
                        <h3>MULTIPLICADOR DEL MICROFONO</h3>
                        <input type="number" class="form-control w-25 m-auto" name="micro" value=")====";
// -------------------------- multiplicador del mucrofono
const String pagina22 = R"====(">
                    </div>
                    <div class="mb-4">
                        <h3>AUMENTAR O DISMINUIR</h3>
                        <div class="w-25 m-auto">
                            <div class="input-group mb-3">
                                <input type="number" class="form-control w-50 m-auto" placeholder="HH"  name="hora" min="-24" max="24" value=")====";
// -------------------------- hora que se va a sumar o restar al reloj
const String pagina23 = R"====(">
                                <input type="number" class="form-control w-50 m-auto" placeholder="MM" name="minuto" min="-60" max="60" value=")====";
// ------------------------- minutos que se va a sumar o restar al reloj
const String pagina24 = R"====(">
                            </div>  
                            <div class="invisible">
                              <input type="number" class="form-control w-50 m-auto" placeholder="MM" name="no" min="-60" max="60" value="1">
                            </div>                        
                        </div>
                    </div>
                    <br>
                    <input type="submit" value="enviar" class="btn btn-outline-info">
                </form>
            </div>
        </div>
    </div>
</body>
</html>)====";

const uint32_t TiempoEsperaWifi = 5000;

unsigned long TiempoActual = 0;
unsigned long TiempoAnterior = 0;
const long TiempoCancelacion = 10000;

WiFiServer servidor(80);

// globales
// numero de leds
const int numLeds = 30;
// tira gabinete
int tira1 = 18;
// tira escritorio
int tira2 = 19;
// reloj
int reloj = 21;
int numLedsReloj = 70;
int relojX = 14;
int relojY = 5;
int tiempoActualReloj = 0;
int tiempoPrevioReloj = 0;
int intervaloReloj = 45000;
int hora = 0;
int minutos = 0;
int tiempoActualPantalla = 10000;
int tiempoPrevioPantalla = 0;
int intervaloPantalla = 250;
// estas variables se tiene que configurar cuando hay notificacion
int notificacion = 0;
int numLogo = 0;
int rojoGTemp = 0;
int verdeGTemp = 0;
int azulGTemp = 0;
int rojoETemp = 0;
int verdeETemp = 0;
int azulETemp = 0;
int encendidoGTemp = 0;
int encendidoETemp = 0;
// microfono
int microfono = 34;
// rele
int rele = 5;
// boton 1
int boton1 = 32;
// boton 2
int boton2 = 33;
// boton 3
int boton3 = 27;
// boton 4
int boton4 = 14;
// boton 5
int boton5 = 12;
// boton 6
int boton6 = 13;
// Definir el número de pin del botón táctil
int boton7 = 15;

// variables para las tiras led
// cada estado indica el efecto
//       0 = apagado
//       1 = encendido
//       2 = musica
//       3 = musica 2
//       4 = recorrer tira
//       5 = encender y apagar
int estadoG = 0;
int estadoE = 0;
int encenderG = 1;
int encenderE = 1;
// color de la tira
int rojoG = 255;
int verdeG = 0;
int azulG = 0;
int brilloG = 255;
int rojoE = 255;
int verdeE = 0;
int azulE = 0;
int brilloE = 255;

// sencibilidaddel microfono
int mulMicrofono = 1;

// variables para el rele
int estadoRele = 0;
// variables para efectode musica 1
int encenderLeds = 0;
int tiempoActualMusica = 0;
int tiempoPrevioMusica = 0;
int intervaloMusica = 500;
// variables para musica 2
int luces[numLeds];
int tiempoActualMusica2 = 0;
int tiempoPrevioMusica2 = 0;
int intervaloMusica2 = 500;
// variables para llenar tira
int tiempoActualLlenar = 0;
int tiempoPrevioLlenar = 0;
int intervaloLlenar = 40;
int ledLlenar = 0;
// variables para respirar
int tiempoActualRes = 0;
int tiempoPrevioRes = 0;
int intervaloRes = 10;
int brillo = 0;
bool respirar = true;
// variables de la pagina
String valorHexa = "#FF0000";
int rojoTemp = 255;
int verdeTemp = 0;
int azulTemp = 0;

// variables para hora
int horaSumar = 0;
int minSumar = 0;

const int logo[3][5][3] = {
  // youtube
    {
        {0, 0, 0},
        {0, 1, 0},
        {0, 1, 1},
        {0, 1, 0},
        {0, 0, 0}
    },
    // facebook
    {
        {0, 1, 1},
        {0, 1, 0},
        {1, 1, 1},
        {0, 1, 0},
        {0, 1, 0}
    },
    // whatsapp
    {
        {0, 1, 0},
        {0, 1, 0},
        {0, 1, 0},
        {0, 0, 0},
        {0, 1, 0}
    },
};
const int num0_9[10][5][3] = {
    // 0
    {
        {1, 1, 1},
        {1, 0, 1},
        {1, 0, 1},
        {1, 0, 1},
        {1, 1, 1}
    },
    // 1
    {
        {0, 1, 0},
        {0, 1, 0},
        {0, 1, 0},
        {0, 1, 0},
        {0, 1, 0}
    },
    // 2
    {
        {1, 1, 1},
        {0, 0, 1},
        {1, 1, 1},
        {1, 0, 0},
        {1, 1, 1}
    },
    // 3
    {
        {1, 1, 1},
        {0, 0, 1},
        {1, 1, 1},
        {0, 0, 1},
        {1, 1, 1}
    },
    // 4
    {
        {1, 0, 1},
        {1, 0, 1},
        {1, 1, 1},
        {0, 0, 1},
        {0, 0, 1}
    },
    // 5
    {
        {1, 1, 1},
        {1, 0, 0},
        {1, 1, 1},
        {0, 0, 1},
        {1, 1, 1}
    },
    // 6
    {
        {1, 1, 1},
        {1, 0, 0},
        {1, 1, 1},
        {1, 0, 1},
        {1, 1, 1}
    },
    // 7
    {
        {1, 1, 1},
        {0, 0, 1},
        {0, 0, 1},
        {0, 0, 1},
        {0, 0, 1}
    },
    // 8
    {
        {1, 1, 1},
        {1, 0, 1},
        {1, 1, 1},
        {1, 0, 1},
        {1, 1, 1}
    },
    // 9
    {
        {1, 1, 1},
        {1, 0, 1},
        {1, 1, 1},
        {0, 0, 1},
        {1, 1, 1}
    }
};


// pratiras led
#include <Adafruit_NeoPixel.h>

// gabinete
Adafruit_NeoPixel pixelsG(numLeds, tira1, NEO_GRB + NEO_KHZ800);
// escritorio
Adafruit_NeoPixel pixelsE(numLeds, tira2, NEO_GRB + NEO_KHZ800);
// reloj
Adafruit_NeoPixel pixelsReloj(numLedsReloj, reloj, NEO_GRB + NEO_KHZ800);

void setup()
{
  randomSeed(analogRead(0));  // Puedes usar cualquier pin analógico

  // wifi
  Serial.begin(115200);
  Serial.println("\nIniciando Wifi");

