irvynX/ESP32/controladorCuarto/src/main.cpp
  wifiMulti.addAP("Totalplay-2DA1-2", "irvyn2703");

  WiFi.mode(WIFI_STA);
  Serial.print("Conectando a Wifi ..");
  while (wifiMulti.run(TiempoEsperaWifi) != WL_CONNECTED)
  {
  }
  Serial.println(".. Conectado");
  Serial.print("SSID:");
  Serial.print(WiFi.SSID());
  Serial.print(" ID:");
  Serial.println(WiFi.localIP());

  servidor.begin();

  //MDNS.addService("http", "tcp", 80);

  // preparar entradas
  pinMode(microfono, INPUT);
  pinMode(rele, OUTPUT);
  pinMode(boton1, INPUT);
  pinMode(boton2, INPUT);
  pinMode(boton3, INPUT);
  pinMode(boton4, INPUT);
  pinMode(boton5, INPUT);
  pinMode(boton6, INPUT);
  pinMode(boton7, INPUT);

  pixelsReloj.begin();
  pixelsReloj.setBrightness(1);
  pixelsReloj.show();
  
  pixelsG.begin();
  pixelsE.begin();

  pixelsG.show();
  pixelsE.show();
}

// metodos simples --------------------------------------------
void encedeApagarTiraG()
{
  if (encenderG == 1)
  {
    encenderG = 0;
  }
  else
  {
    encenderG = 1;
  }
}

void encedeApagarTiraE()
{
  if (encenderE == 1)
  {
    encenderE = 0;
  }
  else
  {
    encenderE = 1;
  }
}

void encedeApagarFoco()
{
  if (estadoRele == 1)
  {
    estadoRele = 0;
  }
  else
  {
    estadoRele = 1;
  }
}

void cambiarEfectoG()
{
  estadoG++;
  if (estadoG > 4)
  {
    estadoG = 0;
  }
}

void cambiarEfectoE()
{
  estadoE++;
  if (estadoE > 4)
  {
    estadoE = 0;
  }
}

void encenderRele(){
  digitalWrite(rele, LOW);
}

void apagarRele(){
  digitalWrite(rele, HIGH);
}

int leerMicro()
{
  // Leer el nivel de audio desde el micrófono
  int nivelAudio = analogRead(microfono) * mulMicrofono;
  //Serial.println(nivelAudio);
  if (nivelAudio < 0){
    nivelAudio = 0;
  }
  if (nivelAudio > 4000){
    nivelAudio = 4000;
  }
  // Convertir el nivel de audio en la cantidad de LED que se deben encender
  int cantidadLEDs = map(nivelAudio, 0, 4000, 0, numLeds-1);
  // Serial.println("microfono: " + cantidadLEDs);

  return cantidadLEDs;
}

void hexaRGB (String valor){
  String hexColor = "#"; // valor hexadecimal
  hexColor = hexColor + valor;
  long number = (long) strtol(&hexColor[1], NULL, 16); // Convertir hexadecimal a decimal
  int r = (number >> 16) & 255; // Obtener valor de rojo
  int g = (number >> 8) & 255; // Obtener valor de verde
  int b = number & 255; // Obtener valor de azul

  Serial.print(r); // Imprimir valor de rojo en la consola serie
  Serial.print(",");
  Serial.print(g); // Imprimir valor de verde en la consola serie
  Serial.print(",");
  Serial.println(b); // Imprimir valor de azul en la consola serie

  rojoTemp = r;
  verdeTemp = g;
  azulTemp = b;
}

void RGBhexa(int r, int g, int b) {
  char hexR[3];
  char hexG[3];
  char hexB[3];
  
  sprintf(hexR, "%02X", r);
  sprintf(hexG, "%02X", g);
  sprintf(hexB, "%02X", b);

  valorHexa = "#" + String(hexR) + String(hexG) + String(hexB); // Combinar con "#" y la cadena con ceros a la izquierda
  Serial.println(valorHexa);
}

void obtenerHora() {
    HTTPClient http;

    http.begin("http://worldtimeapi.org/api/timezone/America/Mexico_City");

    int httpCode = http.GET();

    if (httpCode == HTTP_CODE_OK)
    {
        String payload = http.getString();

        DynamicJsonDocument doc(1024);
        DeserializationError error = deserializeJson(doc, payload);

        if (!error)
        {
            String horaCompleta = doc["datetime"];

            hora = horaCompleta.substring(11, 13).toInt();
            minutos = horaCompleta.substring(14, 16).toInt();
            if (hora > 12)
            {
              hora -= 12;
            }
            

            Serial.print(hora);
            Serial.print(":");
            Serial.println(minutos);
        }
        else
        {
            Serial.println("Error parsing JSON");
        }
    }
    else
    {
        Serial.println("HTTP request failed");
    }

    http.end();
}

//-----------------------------------metodos de los efectos --------------------------------

//-----------------------------------efecto Musica -----------------------------------------
void efectoMusica(Adafruit_NeoPixel &miPixels, int num)
{
  tiempoActualMusica = millis();
  if (tiempoActualMusica - tiempoPrevioMusica >= intervaloMusica){
    encenderLeds = leerMicro();
  }
  if (num == 1)
  {
    // tiraG efecto 1
    miPixels.fill(miPixels.Color(rojoG, verdeG, azulG), 0, encenderLeds);
    miPixels.fill(miPixels.Color(0, 0, 0), encenderLeds, numLeds);
    miPixels.show();
  }
  if (num == 2)
  {
    // tiraG efecto 2
    miPixels.fill(miPixels.Color(rojoG, verdeG, azulG), 0, numLeds);
    miPixels.setBrightness(map(encenderLeds, 0, numLeds, 0, 255));
    miPixels.show();
  }
  if (num == 3)
  {
    // tiraE efecto 1
    miPixels.fill(miPixels.Color(rojoE, verdeE, azulE), 0, encenderLeds);
    miPixels.fill(miPixels.Color(0, 0, 0), encenderLeds, numLeds);
    miPixels.show();
  }
  if (num == 4)
  {
    // tiraE efecto 2
    miPixels.fill(miPixels.Color(rojoE, verdeE, azulE), 0, numLeds);
    miPixels.setBrightness(map(encenderLeds, 0, numLeds, 0, 255));
    miPixels.show();
  }
}
//-----------------------------------efecto llenar tira -----------------------------------------
void llenarTira(Adafruit_NeoPixel &miPixelsG,Adafruit_NeoPixel &miPixelsE){
  tiempoActualLlenar = millis();
  if (tiempoActualLlenar - tiempoPrevioLlenar >= intervaloLlenar){
    if(estadoG == 3){
      miPixelsG.setPixelColor(ledLlenar - 4, rojoG/16, verdeG/16, azulG/16);
      miPixelsG.setPixelColor(ledLlenar - 3, rojoE/8, verdeE/8, azulE/8);
      miPixelsG.setPixelColor(ledLlenar - 2, rojoE/4, verdeE/4, azulE/4);
      miPixelsG.setPixelColor(ledLlenar - 1, rojoE/2, verdeE/2, azulE/2);
      miPixelsG.setPixelColor(ledLlenar, rojoE, verdeE, azulE);
      miPixelsG.show();
    }
    if(estadoE == 3){
      miPixelsE.setPixelColor(ledLlenar - 4, rojoE/16, verdeE/16, azulE/16);
      miPixelsE.setPixelColor(ledLlenar - 3, rojoG/8, verdeG/8, azulG/8);
      miPixelsE.setPixelColor(ledLlenar - 2, rojoG/4, verdeG/4, azulG/4);
      miPixelsE.setPixelColor(ledLlenar - 1, rojoG/2, verdeG/2, azulG/2);
      miPixelsE.setPixelColor(ledLlenar, rojoG, verdeG, azulG);
      miPixelsE.show();
    }
    ledLlenar++;
    if (ledLlenar > numLeds)
    {
      ledLlenar = 0;
    }
    tiempoPrevioLlenar = millis();
  }
}

//-----------------------------------efecto respirar tira -----------------------------------------
void repirar(){
  tiempoActualRes = millis();
  if (tiempoActualRes - tiempoPrevioRes >= intervaloRes)
  {
    if (estadoG == 4)
    {
      pixelsG.fill(pixelsG.Color(rojoG, verdeG, azulG), 0, numLeds);
      pixelsG.setBrightness(brillo);
      pixelsG.show();
    }
    if (estadoE == 4)
    {
      pixelsE.fill(pixelsE.Color(rojoE, verdeE, azulE), 0, numLeds);
      pixelsE.setBrightness(brillo);
      pixelsE.show();
    }
    Serial.println(brillo);
    if (respirar == true)
    {
      brillo++;
      if (brillo > 254)
      {
        respirar = false;
      }
    }
    else
    {
      brillo--;
      if (brillo < 1)
      {
        respirar = true;
      }
    }
    tiempoPrevioRes = millis();
  }
}

//----------------------------------- metodos para resporder y leer el cliente -------------------
//----------------------------------- metodo para enviar la pagina al cliente -------------------
void ResponderCliente(WiFiClient &cliente){
  cliente.print(pagina1);
  if(estadoRele == 1){
    cliente.print("checked");
  }
  cliente.print(pagina2);
  if(estadoRele == 0){
    cliente.print("checked");
  }
  cliente.print(pagina3);
  if(encenderE == 1){
    cliente.print("checked");
  }
  cliente.print(pagina4);
  if(encenderE == 0){
    cliente.print("checked");
  }
  cliente.print(pagina5);
  if(estadoE == 0){
    cliente.print("checked");
    cliente.print(pagina6);
    cliente.print(pagina7);
    cliente.print(pagina8);
    cliente.print(pagina9);
  }
  if(estadoE == 1){
    cliente.print(pagina6);
    cliente.print("checked");
    cliente.print(pagina7);
    cliente.print(pagina8);
    cliente.print(pagina9);
  }
  if(estadoE == 2){
    cliente.print(pagina6);
    cliente.print(pagina7);
    cliente.print("checked");
    cliente.print(pagina8);
    cliente.print(pagina9);
  }
  if(estadoE == 3){
    cliente.print(pagina6);
    cliente.print(pagina7);
    cliente.print(pagina8);
    cliente.print("checked");
    cliente.print(pagina9);
  }
  if(estadoE == 4){
    cliente.print(pagina6);
    cliente.print(pagina7);
    cliente.print(pagina8);
    cliente.print(pagina9);
    cliente.print("checked");
  }
  cliente.print(pagina10);
  cliente.print(brilloE);
  cliente.print(pagina11);
  RGBhexa(rojoE, verdeE, azulE);
  cliente.print(valorHexa);
  cliente.print(pagina12);
  if(encenderG == 1){
    cliente.print("checked");
  }
  cliente.print(pagina13);
  if(encenderG == 0){
    cliente.print("checked");
  }
  cliente.print(pagina14);
  if(estadoG == 0){
    cliente.print("checked");
    cliente.print(pagina15);
    cliente.print(pagina16);
    cliente.print(pagina17);
    cliente.print(pagina18);
  }
  if(estadoG == 1){
    cliente.print(pagina15);
    cliente.print("checked");
    cliente.print(pagina16);
    cliente.print(pagina17);
    cliente.print(pagina18);
  }
  if(estadoG == 2){
    cliente.print(pagina15);
    cliente.print(pagina16);
    cliente.print("checked");
    cliente.print(pagina17);
    cliente.print(pagina18);
  }
  if(estadoG == 3){
    cliente.print(pagina15);
    cliente.print(pagina16);
    cliente.print(pagina17);
    cliente.print("checked");
    cliente.print(pagina18);
  }
  if(estadoG == 4){
    cliente.print(pagina15);
    cliente.print(pagina16);
    cliente.print(pagina17);
    cliente.print(pagina18);
    cliente.print("checked");
  }
  cliente.print(pagina19);
  cliente.print(brilloG);
  cliente.print(pagina20);
  RGBhexa(rojoG, verdeG, azulG);
  cliente.print(valorHexa);
  cliente.print(pagina21);
  cliente.print(mulMicrofono);
  cliente.print(pagina22);
  cliente.print(horaSumar);
  cliente.print(pagina23);
  cliente.print(minSumar);
  cliente.print(pagina24);
}

